##########################################################################
# Base image
##########################################################################

# Используем официальный образ Python в качестве базового
FROM python:3.10 as base

# Устанавливаем рабочую директорию в контейнере
WORKDIR /app

# Копируем requirements.txt и устанавливаем зависимости
COPY requirements.txt .
RUN pip install --no-cache-dir -r requirements.txt

# Устанавливаем Gunicorn
RUN pip install gunicorn

# Копируем все остальные файлы в рабочую директорию
COPY . .

##########################################################################
# Web service
##########################################################################

FROM base

# Устанавливаем переменные окружения
ENV FLASK_APP=app.py

# Открываем порт, на котором будет работать приложение
EXPOSE 8000

# Запускаем приложение через Gunicorn с 4 воркерами
CMD ["gunicorn", "-w", "4", "-b", "0.0.0.0:8000", "app:app"]
